/*  Задача 1
//Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго
Console.WriteLine("Input first number: ");
int n1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Input second number: ");
int n2 = Convert.ToInt32(Console.ReadLine());
bool A = n1 == n2 * n2; //n1 в квадрате равен n2*n2
Console.WriteLine(A);
//решено!!!!

*/

/* Задача 2
Console.Write("Input a positive integer number: ");
int n = Convert.ToInt32(Console.ReadLine());
int current = -n;
while (current <= n)
{
    Console.Write(current + " ");
    current++;
}
*/